#include <stdio.h>
// #include는 C언어에서 <> 안에 있는 헤더 파일(.h)를 프로그램에 포함하라는
// 명령을 처리하는 키워드입니다.

// 1. 헤더 파일(Header file) 또는 인클루드 파일(include file)은
// 여러 가지 기능들을 모아놓은 파일로 확장자명이 .h입니다.

// 2. 키워드(Keyword) : C언어에서 특정 기능을 진행하기 위해 설정한 32개의 영단어를 의미합니다.

// 주석(comment) : 프로그램 코드에 영향을 주지 않고 메모만 남기는 용도
// 코드 작성 시 주석이 많이 필요한 설계는 좋지 않음.

int main()
{
    printf("Hello, My name is Joonki");
    return 0;
}

// 1. 함수(fnuction) : 특정 하나의 명령을 수행하기 위해 명령문들을 모아놓은 집합체
// 함수이름() { }의 형태를 가지고 있습니다.

// 2. printf();는 콘솔 창에 작성한 내용을 출력하는 기능임니다.
// () 안에는 큰 따옴표("")를 작성하고 큰 따옴표 안에는 작성할 내용을 적습니다.

// 3. return은  함수를 종료하는 키워드입니다. return 다음에 값을 적으면 그 값이
// 함수를 호출한 위치 쪽으로 전달됩니다.



